import http.client
import json
import urllib.parse

conn = http.client.HTTPConnection("10.10.100.77")
payload = json.dumps({
  "Date": "2025-10-10T00:00:00",
  "Posted": False,
  "Организация_Key": "72201a7e-7fef-11ef-ad66-74563c634acb",
  "Статус": "НеСогласована",
  "ХозяйственнаяОперация": "ОплатаПоставщику",
  "СуммаДокумента": 50000,
  "Валюта_Key": "f04b98ee-b430-11ea-a43c-b42e994e04d3",
  "ФормаОплатыНаличная": True,
  "ФормаОплатыБезналичная": False,
  "ФормаОплатыПлатежнаяКарта": False,
  "НазначениеПлатежа": "Оплата по счету №22637559 от 10.10.2025\nВ т.ч. НДС (20%) 8333 руб.",
  "ЖелательнаяДатаПлатежа": "2025-11-19T00:00:00",
  "Контрагент_Key": "f7289e62-5309-11ef-ad62-74563c634acb",
  "Партнер_Key": "f7289e62-5309-11ef-ad62-74563c634acb",
  "БанковскийСчетКонтрагента_Key": "00000000-0000-0000-0000-000000000000",
  "вс_НомерПоДаннымПоставщика": "22637559",
  "вс_ДатаПоДаннымПоставщика": "2025-10-10T00:00:00",
  "КтоЗаявил_Key": "be7e04e0-4eaf-11e3-8632-50e549c4019a",
  "КтоРешил_Key": "be7e04e0-4eaf-11e3-8632-50e549c4019a",
  "Автор_Key": "be7e04e0-4eaf-11e3-8632-50e549c4019a",
  "СтатьяДвиженияДенежныхСредств_Key": "2af55520-f34a-11ef-ad72-74563c634acb",
  "ПланированиеСуммы": "ВВалютеПлатежа",
  "СтатьяАктивовПассивов_Key": "00000000-0000-0000-0000-000000000000",
  "ВариантОплаты": "ПредоплатаДоПоступления",
  "Комментарий": "тест",
  "ФормаОплатыЗаявки": "",
  "РасшифровкаПлатежа": [
    {
      "LineNumber": 1,
      "Номенклатура_Key": "00000000-0000-0000-0000-000000000000",
      "СтатьяРасходов_Key": "2af55520-f34a-11ef-ad72-74563c634acb",
      "Сумма": 50000,
      "СуммаБезНДС": 41667,
      "СуммаНДС": 8333,
      "СтавкаНДС_Key": "ed59436e-f9dc-11ee-ad54-74563c634acb",
      "Количество": 1,
      "Цена": 50000
    }
  ],
  "Подразделение_Key": "afc66ff1-4cea-11f0-ad78-74563c634acb"
})
headers = {
  'Authorization': 'Basic 0KjQuNC60YPQvdC+0LLQlTohUUFaMndzeA==',
  'Content-Type': 'application/json'
}
endpoint = "/trade/odata/standard.odata/Document_ЗаявкаНаРасходованиеДенежныхСредств"
encoded_endpoint = urllib.parse.quote(endpoint, safe="/:?=.$&_")
conn.request("POST", f"{encoded_endpoint}?$format=json", payload, headers)
res = conn.getresponse()
data = res.read()
print(data.decode("utf-8"))